#+TITLE: Day 8
#+PROPERTY: header-args:python :session day8
#+PROPERTY: header-args:python+ :tangle main.py
#+PROPERTY: header-args:python+ :results value
#+PROPERTY: header-args:python+ :shebang "#!/usr/bin/env python"

In our previous project, we used LangChain and learned about the RAG to
implement a Q&A AI assistant that pulled data from a vertex database we
populated. Now we are going to be building a resume and cover letter helper
using Pydantic

#+BEGIN_SRC elisp :exports none :results none
  (setq org-babel-python-command (concat
                                  (file-name-directory (or load-file-name (buffer-file-name)))
                                  ".venv/bin/python"))
#+END_SRC

#+begin_src python :exports none :results none
  # This file was generated from the README.org found in this directory
#+end_src

In this section we are going to learn a super powerful library called Pydantic
that allows us to perform output validation.

* Generate parsed structured output
  Now we will attempt to generate parsed structured output from OpenAI with
  Pydantic. To begin we will load our API Keys similar to how we have done
  before:
  #+name: loadapikeys
  #+begin_src python :results output :exports both
    # Import necessary libraries
    import os
    import google.generativeai as genai
    from openai import OpenAI  # Make sure you have the latest openai package (pip install --upgrade openai)
    from dotenv import load_dotenv
    import json

    # Importing type hints that help describe what kind of data your Python functions or classes expect or return.
    # List: A list of elements, all usually of the same type.
    # Example: List[int] means a list of integers like [1, 2, 3].

    # Dict: A dictionary (key-value pairs).
    # Example: Dict[str, int] means keys are strings and values are integers like {'a': 1, 'b': 2}.

    # Union: Either one type or another.
    # Example: Union[int, str] means the value can be an int or a str.

    # Optional: Means a value can be the type you expect or None.
    # Example: Optional[int] is the same as Union[int, None].

    # Any: Anything at all — no restriction on type.
    # You can pass an int, string, list, object, etc.
    from typing import List, Dict, Union, Optional, Any
    from IPython.display import display, Markdown

    print("Libraries imported successfully!")

    # Load environment variables from the .env file
    load_dotenv()

    # Fetch API keys from environment variables
    openai_api_key = os.getenv("OPENAI_API_KEY")
    google_api_key = os.getenv("GOOGLE_API_KEY")

    # Configure the APIs
    openai_client = OpenAI(api_key = openai_api_key)
    genai.configure(api_key = google_api_key)

    # Initialize the Gemini model, choose a suitable model like "gemini-2.0-flash"
    gemini_model = genai.GenerativeModel("gemini-2.0-flash")
  #+end_src

  #+RESULTS: loadapikeys
  : Libraries imported successfully!

  Now let's define a new class we will be using:
  #+name: scientistclass
  #+begin_src python :results none :exports both
    # Let's define a Pydantic model called scientist that describes what a valid response should look like
    class scientist(BaseModel):
      name: str
      field: str
      known_for: list[str]
      birth_year: int
  #+end_src

  Now we can define our prompt we will use:
  #+name: prompt
  #+begin_src python :results none :exports both
    # Let's define a prompt
    prompt = """
    Give me a JSON object with details about a famous scientist.
    Include the following fields: name, field, known_for, and birth_year.
    """
  #+end_src

  Now let's test our prompt:
  #+name: debugprompt
  #+begin_src python :results output :exports both :tangle no
    # Let's make the API call to OpenAI
    # Note that we used "openai_client.beta.chat.completions.parse( )" since we want to parse it into a structured output instead of just plain text 
    response = openai_client.beta.chat.completions.parse(model = "gpt-4o",
                                                     messages = [{"role": "user", 
                                                     "content": prompt}],
        temperature = 0,
        response_format = scientist,  # This tells OpenAI to return a parsed `scientist` object that's defined by Pydantic
        max_tokens = 300)

    # Print the parsed response
    print(response.choices[0].message.content)

    # Use json.loads() to turn the Json into a Python dictionary
    print(json.loads(response.choices[0].message.content))
  #+end_src

  This gives us:
  #+RESULTS: debugprompt
  : {"name":"Albert Einstein","field":"Theoretical Physics","known_for":["Theory of Relativity","Photoelectric Effect","Mass-Energy Equivalence (E=mc²)","Brownian Motion"],"birth_year":1879}
  : {'name': 'Albert Einstein', 'field': 'Theoretical Physics', 'known_for': ['Theory of Relativity', 'Photoelectric Effect', 'Mass-Energy Equivalence (E=mc²)', 'Brownian Motion'], 'birth_year': 1879}

* Change tracking with Pydantic
  Now, we'll use the insights gained (analysis and suggestions) to generate a
  completely rewritten, tailored resume using OpenAI. A key enhancement here is
  to ask the AI not just to list the changes, but to try and identify which
  sections or areas of the resume were modified. This helps the user quickly see
  the impact of the tailoring.

  We'll ask the AI for two outputs:
  1. The full text of the tailored resume.
  2. A structured list (using Markdown) describing the key changes and where
     they were made (e.g., Summary, Experience section, Skills).

  #+name: pydantic
  #+begin_src python :results none :exports both
    # Define Pydantic models for structured output
    # The ResumeOutput class is a Pydantic model that defines the structure of the output
    # for the resume generation function. It includes two fields:
    # (1) updated_resume: A string that contains the final rewritten resume.
    # (2) diff_markdown: A string containing the resume's HTML-coloured version highlighting additions and deletions.

    class ResumeOutput(BaseModel):
        updated_resume: str
        diff_markdown: str


    def generate_resume(
        job_description_text: str, resume_text: str, gap_analysis_openai: str, model: str = "openai") -> dict:
        """
        Generate a tailored resume using OpenAI or Gemini.

        Args:
            job_description_text (str): The job description text.
            resume_text (str): The candidate's resume text.
            gap_analysis_openai (str): The gap analysis result from OpenAI.
            model (str): The model to use for resume generation.

        Returns:
            dict: A dictionary containing the updated resume and diff markdown.
        """
        # Construct the prompt for the AI model to generate the tailored resume.
        # The prompt includes context, instructions, and input data (original resume,
        # target job description, and gap analysis).
        prompt = (
            """
        ### Context:
        You are an expert resume writer and editor. Your goal is to rewrite the original resume to match the target job description, using the provided tailoring suggestions and analysis.

        ---

        ### Instruction:
        1. Rewrite the entire resume to best match the **Target Job Description** and **Gap Analysis to the Job Description**.
        2. Improve clarity, add job-relevant keywords, and quantify achievements.
        3. Specifically address the gaps identified in the analysis by:
           - Adding missing skills and technologies mentioned in the job description
           - Reframing experience to highlight relevant accomplishments
           - Strengthening sections that were identified as weak in the analysis
        4. Prioritize addressing the most critical gaps first
        5. Incorporate industry-specific terminology from the job description
        6. Ensure all quantifiable achievements are properly highlighted with metrics
        7. Return two versions of the resume:
            - `updated_resume`: The final rewritten resume (as plain text)
            - `diff_html`: A version of the resume with inline highlights using color:
                - Additions or rewritten content should be **green**:  
                `<span style="color:green">your added or changed text</span>`
                - Removed content should be **red and struck through**:  
                `<span style="color:red;text-decoration:line-through">removed text</span>`
                - Leave unchanged lines unmarked.
            - Keep all section headers and formatting consistent with the original resume.

        ---

        ### Output Format:

        ```json
        {
        "updated_resume": "<full rewritten resume as plain text>",
        "diff_markdown": "<HTML-colored version of the resume highlighting additions and deletions>"
        }
        ```
        ---
        ### Input:

        ,**Original Resume:**

        """
            + resume_text
            + """


        ,**Target Job Description:**

        """
            + job_description_text
            + """


        ,**Analysis of Resume vs. Job Description:**

        """
            + gap_analysis_openai
        )

        # Depending on the selected model, call the appropriate function to generate the resume.
        # If the OpenAI model is selected, it uses a temperature of 0.7 for creativity.
        if model == "openai":
            updated_resume_json = openai_generate(prompt, temperature = 0.7, response_format = ResumeOutput)
        # If the Gemini model is selected, it uses a lower temperature of 0.5 for more focused results.
        elif model == "gemini":
            updated_resume_json = gemini_generate(prompt, temperature = 0.5)
        else:
            # Raise an error if an invalid model name is provided.
            raise ValueError(f"Invalid model: {model}")

        # Return the generated resume output as a dictionary.
        return updated_resume_json
  #+end_src

  Now we can test it out:
  #+name: debugpydantic
  #+begin_src python :results output :exports both :tangle no
    # Call the generate_resume function with the provided job description, resume text, and gap analysis.
    updated_resume_json = generate_resume(job_description_text, resume_text, gap_analysis_openai, model="openai")
    # Display the updated resume in Markdown format.
    print(updated_resume_json.updated_resume)

    print(updated_resume_json.diff_markdown)
  #+end_src

  #+RESULTS: debugpydantic
  #+begin_example
  ,**Jessica Brown**  
  jessica.brown@email.com | (416) 555-7890 | linkedin.com/in/jessicabrown

  ,**Summary**  
  Digital Marketing Specialist with over 2 years of experience in planning and executing digital marketing campaigns, including SEO, SEM, social media, and email marketing. Proficient in using Google Analytics for performance measurement and reporting. Skilled in content creation, social media management, and staying informed on digital marketing trends.

  ,**Experience**

  ,**Digital Marketing Assistant | Brewster Coffee Co. | Toronto, ON | Jan 2022 – Present**
  - Planned and executed digital marketing campaigns, including SEO and SEM efforts, to enhance online presence.
  - Utilized Google Analytics to measure campaign performance and prepared detailed performance reports.
  - Conducted keyword research and optimized content for SEO, increasing website traffic by 20%.
  - Managed social media accounts, scheduled content, and engaged with the community, achieving a 30% growth in followers.
  - Collaborated with designers to coordinate campaign materials, ensuring brand consistency.
  - Conducted market research and competitor analysis to inform campaign strategies.
  - Stayed updated on digital marketing trends to implement innovative strategies.

  ,**Skills**
  - Digital Marketing (SEO, SEM, Email Marketing)
  - Social Media Management Tools (Hootsuite, Buffer)
  - Google Analytics, Basic Adobe Creative Suite
  - CRM Systems (HubSpot)
  - Microsoft Office Suite, Google Workspace

  ,**Education**  
  ,**Bachelor of Commerce, Marketing** | Toronto Metropolitan University (formerly Ryerson University), Toronto, ON | May 2021
  ,**Jessica Brown**  
  jessica.brown@email.com | (416) 555-7890 | linkedin.com/in/jessicabrown

  ,**Summary**  
  <span style="color:red;text-decoration:line-through">Marketing professsional with 2 years of experience assisting in digital campaigns, content creation, and social media activities. Comfortable handling multiple tasks and providing general marketing support.</span><span style="color:green">Digital Marketing Specialist with over 2 years of experience in planning and executing digital marketing campaigns, including SEO, SEM, social media, and email marketing. Proficient in using Google Analytics for performance measurement and reporting. Skilled in content creation, social media management, and staying informed on digital marketing trends.</span>

  ,**Experience**

  <span style="color:red;text-decoration:line-through">**Marketing Asssistant</span><span style="color:green">**Digital Marketing Assistant</span> | Brewster Coffee Co. | Toronto, ON | Jan 2022 – Present**
  - <span style="color:red;text-decoration:line-through">Assisted with</span><span style="color:green">Planned and executed</span> digital marketing campaigns<span style="color:green">, including SEO and SEM efforts,</span> to enhance online presence.
  - <span style="color:green">Utilized Google Analytics to measure campaign performance and prepared detailed performance reports.</span>
  - <span style="color:green">Conducted keyword research and optimized content for SEO, increasing website traffic by 20%.</span>
  - <span style="color:red;text-decoration:line-through">Created blog posts and social media updates to improve audience engagement.</span>
  - <span style="color:red;text-decoration:line-through">Managed</span><span style="color:green">Managed social media accounts, scheduled content, and engaged with the community, achieving a 30% growth in followers.</span>
  - <span style="color:red;text-decoration:line-through">Supported coordination of marketing events.</span><span style="color:green">Collaborated with designers to coordinate campaign materials, ensuring brand consistency.</span>
  - Conducted market research and competitor analysis<span style="color:green"> to inform campaign strategies</span>.
  - <span style="color:green">Stayed updated on digital marketing trends to implement innovative strategies.</span>

  ,**<span style="color:red;text-decoration:line-through">Skils</span><span style="color:green">Skills</span>**
  - Digital Marketing (<span style="color:green">SEO, SEM, </span>Email Marketing)
  - <span style="color:red;text-decoration:line-through">Social Media Tools</span><span style="color:green">Social Media Management Tools</span> (Hootsuite, Buffer)
  - <span style="color:green">Google Analytics, Basic Adobe Creative Suite</span>
  - <span style="color:green">CRM Systems (HubSpot)</span>
  - Microsoft Office Suite, Google Workspace

  ,**Education**  
  ,**Bachelor of Commerce, Marketing** | <span style="color:red;text-decoration:line-through">Ryerson University (now</span><span style="color:green">Toronto Metropolitan University (formerly</span> Ryerson University) , Toronto, ON | May 2021
  #+end_example

